PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_process.c
/**
 * @file rtos_process.c
 * This module implements the process related functionality like querying the number of
 * errors, recognized and counted for a process and suspension of a (failing) process.
 *
 * Copyright (C) 2019 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   rtos_grantPermissionSuspendProcess
 *   rtos_scSmplHdlr_suspendProcess
 *   rtos_osReleaseProcess
 *   rtos_osSuspendProcess
 *   rtos_isProcessSuspended
 *   rtos_getNoTotalTaskFailure
 *   rtos_getNoTaskFailure
 * Module inline interface
 * Local functions
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <limits.h>
#include <assert.h>

#include "MPC5643L.h"

#include "typ_types.h"
#include "rtos_process.h"
#include "rtos_process_defSysCalls.h"
#include "rtos.h"
#include "rtos_systemCall.h"
#include "rtos_ivorHandler.h"


/*
 * Defines
 */

/** Companion of C's offsetof: The size of a field inside a struct. */
#define sizeoffield(type, fieldName) (sizeof(((type*)0)->fieldName))

/** The C code has an interface with the assembler code. It is used to exchange process and
    task related information. The interface is modeled twice, once as structs for C code
    and once as set of preprocessor macros, which hold size of data structures and offsets
    of fields. Here, we have a macro, which double-checks the equivalence of both
    definitions. The compiler will abort the compilation if there is an inconsistency.\n
      The macro needs to by compiled at least once, anywhere in the code. All checks are
    done at compile-time and the compiler won't emit any machine code; therefore, it
    doesn't matter where to place the macro. */
#define CHECK_INTERFACE_S2C                                                                 \
    static_assert( sizeof(rtos_taskDesc_t) == SIZE_OF_TASK_CONF                             \
                   &&  offsetof(rtos_taskDesc_t, addrTaskFct) == O_TCONF_pFct               \
                   &&  offsetof(rtos_taskDesc_t, addrTaskFct) == 0                          \
                   &&  sizeoffield(rtos_taskDesc_t, addrTaskFct) == 4                       \
                   &&  sizeoffield(rtos_taskDesc_t, addrTaskFct) == sizeof(uintptr_t)       \
                   &&  offsetof(rtos_taskDesc_t, tiTaskMax) == O_TCONF_tiMax                \
                   &&  sizeoffield(rtos_taskDesc_t, tiTaskMax) == 4                         \
                   &&  offsetof(rtos_taskDesc_t, PID) == O_TCONF_pid                        \
                   &&  sizeoffield(rtos_taskDesc_t, PID) == 1                               \
                 , "struct rtos_taskDesc_t: Inconsistent interface between"                 \
                   " assembler and C code"                                                  \
                 );                                                                         \
    static_assert( sizeof(processDesc_t) == SIZE_OF_PROCESS_DESC                            \
                   &&  offsetof(processDesc_t, userSP) == O_PDESC_USP                       \
                   &&  O_PDESC_USP == 0                                                     \
                   &&  offsetof(processDesc_t, state) == O_PDESC_ST                         \
                   &&  sizeoffield(processDesc_t, state) == 1                               \
                   &&  offsetof(processDesc_t, cntTotalTaskFailure) == O_PDESC_CNTTOT       \
                   &&  sizeoffield(processDesc_t, cntTotalTaskFailure) == 4                 \
                   &&  offsetof(processDesc_t, cntTaskFailureAry) == O_PDESC_CNTTARY        \
                   &&  sizeoffield(processDesc_t, cntTaskFailureAry)                        \
                       == RTOS_NO_CAUSES_TASK_ABORTION*4                                    \
                 , "struct processDesc_t: Inconsistent interface between"                   \
                   " assembler and C code"                                                  \
                 );

/*
 * Local type definitions
 */

/* Run-time data describing a process. An object of this type must be allocated in RAM,
   which is not write-permitted for user code. */
typedef struct processDesc_t
{
    /** When preempting a task that belongs to this process then the IVOR #4 handler will
        store the current user mode stack pointer value in \a userSP. The stored value may
        be used later as initial stack pointer value of a newly started task from the same
        process.\n
          In the assembler code addressed to by offset #O_PDESC_USP. */
    uint32_t userSP;

    /** The state of the process. This field is e.g. checked at the end of a preemption of
        a task of this process to see if the task may be continued or if the process has
        been stopped meanwhile.\n
          A non zero value means process is running, zero means process stopped.\n
          In the assembler code addressed to by offset #O_PDESC_ST. */
    uint8_t state;

    /** The total count of errors for the process since the start of the kernel. Or the sum
        of all element in array \a cntTaskFailureAry. Or total number of abnormal abortions
        of tasks belonging to the process. */
    uint32_t cntTotalTaskFailure;

    /** This is an array of counters for task termination. The tasks of a process are not
        separated in these counters. Each array entry means another cause, where a cause
        normally is a specific CPU exception.\n
          See file rtos_ivorHandler.h, #RTOS_CAUSE_TASK_ABBORTION_MACHINE_CHECK and
        following, for the enumerated causes. */
    uint32_t cntTaskFailureAry[RTOS_NO_CAUSES_TASK_ABORTION];

