PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_process.c
} processDesc_t;


/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/* Forward declaration of pointers to boundaries of stack areas, which are actually
   defined in the linker script. Used to initialize the global process structure. */
extern uint32_t ld_stackEndP1[0], ld_stackEndP2[0], ld_stackEndP3[0], ld_stackEndP4[0];

/** Array holding run-time data for all processes. Note the process IDs have a one based
    index (as 0 is reserved for the kernel process) but this is a normal array with zero
    based index. Use PID-1 as index into the array. */
processDesc_t SECTION(.data.OS.rtos_processAry) rtos_processAry[RTOS_NO_PROCESSES] =
{
    /** Process 1. */
    [0] = { .userSP = (uint32_t)ld_stackEndP1 - 16
            , .state = 0
            , .cntTotalTaskFailure = 0
            , .cntTaskFailureAry = {[0 ... (RTOS_NO_CAUSES_TASK_ABORTION-1)] = 0}
          }

    /** Process 2. */
    , [1] = { .userSP = (uint32_t)ld_stackEndP2 - 16
              , .state = 0
              , .cntTotalTaskFailure = 0
              , .cntTaskFailureAry = {[0 ... (RTOS_NO_CAUSES_TASK_ABORTION-1)] = 0}
            }

    /** Process 3. */
    , [2] = { .userSP = (uint32_t)ld_stackEndP3 - 16
              , .state = 0
              , .cntTotalTaskFailure = 0
              , .cntTaskFailureAry = {[0 ... (RTOS_NO_CAUSES_TASK_ABORTION-1)] = 0}
            }

    /** Process 4. */
    , [3] = { .userSP = (uint32_t)ld_stackEndP2 - 16
              , .state = 0
              , .cntTotalTaskFailure = 0
              , .cntTaskFailureAry = {[0 ... (RTOS_NO_CAUSES_TASK_ABORTION-1)] = 0}
            }
};


/** The option to let a task of process A suspend process B (system call
    rtos_suspendProcess()) is potentially harmful, as a safety relevant supervisory task
    could be hindered from running. This is of course not generally permittable. An
    all-embracing privilege rule cannot be defined because of the different use cases of
    the mechanism. Therefore, we have an explicit table of granted permissions, which can
    be configured at startup time as an element of the operating system initialization
    code.\n
      The bits of the word correspond to the 16 possible combinations of four possible
    caller processes in four possible target processes.
      By default, no permission is granted. */
#if RTOS_NO_PROCESSES == 4
static uint16_t SDATA_OS(_suspendProcess_permissions) = 0;
#else
# error Implementation depends on four being the number of processes
#endif


/*
 * Function implementation
 */

/**
 * Initialize the data structure with all process descriptors. This mainly means to
 * initialize the stack memory.
 *   @return
 * The function returns a non zero value from enumeration \a rtos_errorCode_t if a
 * configuration error is detected. The software must not start up in this case. Normally,
 * you will always receive a \a rtos_err_noError (zero). Since it is only about static
 * configuration, the returned error may be appropriately handled by an assertion.
*   @param isProcessConfiguredAry
 * This array contains an entry for each of the supported processes. After return, the
 * entry with index i tells, whether the process with PID i is configured for use. (Which
 * mainly relates to some stack space configured or not in the linker script.)\n
 *   Note, isProcessConfiguredAry[0] relates to the OS and will always be \a true.
 */
rtos_errorCode_t rtos_initProcesses(bool isProcessConfiguredAry[1+RTOS_NO_PROCESSES])
{
    /* We apply the macro that double-checks the consistency of the two independent
       definitions of the same interface between assembler code and C code. The compiler
       will abort the compilation of this module if there is a discrepancy. */
    CHECK_INTERFACE_S2C

    /* Here, where we have one time called code, we can double-check some static
       constraints of the assembler implementation.
         The configuration table rtos_systemCallDescAry is addressed with a short
       instruction, which requires that it resides at a 15 Bit address. This is ensured by
       the linker script, but better to check it. */
#ifdef DEBUG
    /// @todo Move this code to system call module to avoid the (even wrong) extern statement
    extern const uint8_t rtos_systemCallDescAry[RTOS_NO_SYSTEM_CALLS];
    assert((uintptr_t)rtos_systemCallDescAry < 0x8000);
#endif

    rtos_errorCode_t errCode = rtos_err_noError;

    /* If the kernel process wouldn't be configured correctly then we would never get here. */
    isProcessConfiguredAry[0] = true;

    /* Fill all process stacks with the empty-pattern, which is applied for computing the
       stackusage. */
    extern uint32_t ld_stackStartP1[], ld_stackStartP2[], ld_stackStartP3[], ld_stackStartP4[]
                  , ld_stackEndP1[], ld_stackEndP2[], ld_stackEndP3[], ld_stackEndP4[];
    uint32_t * const stackStartAry[RTOS_NO_PROCESSES] = { [0] = ld_stackStartP1
                                                        , [1] = ld_stackStartP2
                                                        , [2] = ld_stackStartP3
                                                        , [3] = ld_stackStartP4
                                                        };
    const uint32_t * const stackEndAry[RTOS_NO_PROCESSES] = { [0] = ld_stackEndP1
                                                            , [1] = ld_stackEndP2
                                                            , [2] = ld_stackEndP3
                                                            , [3] = ld_stackEndP4
                                                            };
    unsigned int idxP
               , maxPIDInUse = 0;
    for(idxP=0; idxP<RTOS_NO_PROCESSES; ++idxP)
    {
        /* Disable the process by default. */
        rtos_processAry[idxP].state = 0;
        isProcessConfiguredAry[idxP+1] = false;

        /* Stack size: May be zero if process is not used at all. Otherwise we demand a
           reasonable minimum stack size - anything else is almost certain a configuration
           error. */
        const unsigned int sizeOfStack = (unsigned int)stackEndAry[idxP]
                                         - (unsigned int)stackStartAry[idxP];
        if(sizeOfStack > 0)
        {
            if(sizeOfStack >= 256  &&  sizeOfStack <= 0x100000
               &&  ((uintptr_t)stackStartAry[idxP] & 0x7) == 0
               &&  (sizeOfStack & 0x7) == 0
              )
            {
                memset(stackStartAry[idxP], /* c */ 0xa5, sizeOfStack);
                stackStartAry[idxP][sizeOfStack/4 - 4] = 0u;
                stackStartAry[idxP][sizeOfStack/4 - 3] = 0xffffffffu;
                stackStartAry[idxP][sizeOfStack/4 - 2] = 0xffffffffu;
                stackStartAry[idxP][sizeOfStack/4 - 1] = 0xffffffffu;
                rtos_processAry[idxP].userSP = (uint32_t)stackEndAry[idxP] - 16;
                rtos_processAry[idxP].state = 1;

                /* Stack alright, process may be used. */
                isProcessConfiguredAry[idxP+1] = true;

                /* Keep track of the highest PID in use. */
                if(idxP+1 > maxPIDInUse)
                    maxPIDInUse = idxP+1;
            }
            else
                errCode = rtos_err_prcStackInvalid;
        }
        else
            rtos_processAry[idxP].userSP = 0;

        rtos_processAry[idxP].cntTotalTaskFailure = 0;
        memset( &rtos_processAry[idxP].cntTaskFailureAry[0]
              , /* c */ 0
              , sizeOfAry(rtos_processAry[idxP].cntTaskFailureAry)
              );
    } /* End for(All processes) */

    if(errCode == rtos_err_noError)
    {
        /* Caution: Maintenance of this code is required consistently with
           rtos_grantPermissionSuspendProcess() and rtos_scSmplHdlr_suspendProcess(). */
        assert(maxPIDInUse >= 1  &&  maxPIDInUse <= 4);
        const uint16_t mask = 0x1111 << (maxPIDInUse-1);
        if((_suspendProcess_permissions & mask) != 0)
            errCode = rtos_err_suspendPrcBadPermission;
    }

    return errCode;

} /* End of rtos_initProcesses */



/**
 * Operating system initialization function: Grant permissions for using the service
 * rtos_suspendProcess to particular processes. By default, the use of that service is not
 * allowed.\n
 *   By principle, offering service rtos_suspendProcess makes all processes vulnerable,
 * which are allowed as target for the service. A failing, straying process can always hit
 * some ROM code executing the system call with arbitrary register contents, which can then
 * lead to immediate task abortion in and suspension of an otherwise correct process.\n
 *   This does not generally break the safety concept, the potentially harmed process can
 * for example be anyway supervised by another, non-suspendable supervisory process.
 * Consequently, we can offer the service at least on demand. A call of this function
 * enables the service for a particular pair of calling process and targeted process.
 *   @param pidOfCallingTask
 * The tasks belonging to process with PID \a pidOfCallingTask are granted permission to
 * suspend another process. The range is 1 .. #RTOS_NO_PROCESSES, which is double-checked by
 * assertion.
 *   @param targetPID
 * The process with PID \a targetPID is suspended. The range is 1 .. maxPIDInUse-1, which is
 * double-checked later.
 *   @remark
 * It would break the safety concept if we permitted the process with highest privileges to
 * become the target of the service. This is double-checked not here (when it is not yet
 * defined, which particular process that will be) but as part of the RTOS startup
 * procedure; a bad configuration can therefore lead to a later reported run-time error.
 *   @remark
 * This function must be called from the OS context only. It is intended for use in the
 * operating system initialization phase. It is not reentrant. The function needs to be
 * called prior to rtos_osInitKernel().
 */
void rtos_grantPermissionSuspendProcess(unsigned int pidOfCallingTask, unsigned int targetPID)
{
    /* targetPID <= 3: Necessary but not sufficient to double-check
       "targetPID <= maxPIDInUse-1". */
    assert(pidOfCallingTask >= 1  &&  pidOfCallingTask <= 4
           &&  targetPID >= 1  &&  targetPID <= 3
          );

    /* Caution, the code here depends on macro RTOS_NO_PROCESSES being four and needs to be
       consistent with the implementation of rtos_scSmplHdlr_suspendProcess(). */
#if RTOS_NO_PROCESSES != 4
# error Implementation requires the number of processes to be four
#endif
    const unsigned int idxCalledPrc = targetPID - 1u;
    const uint16_t mask = 0x1 << (4u*(pidOfCallingTask-1u) + idxCalledPrc);
    _suspendProcess_permissions |= mask;

} /* End of rtos_grantPermissionSuspendProcess */



/**
 * System call implementation to suspend a process. All currently running tasks belonging
 * to the process are aborted and the process is stopped forever (i.e. there won't be
 * further task starts or I/O driver callback invocations).\n
 *   Suspending a process of PID i is permitted only to processes of PID j>i.
 *   @param pidOfCallingTask
 * Process ID of calling user task.
 *   @param PID
 * The ID of the process to suspend. Needs to be not zero (OS process) and lower than the
 * ID of the calling process. Otherwise the calling task is aborted with exception
 * #RTOS_ERR_PRC_SYS_CALL_BAD_ARG.
 *   @remark
 * The system call is the implementation of a system call of conformance class "simple".
 * Such a system call can be implemented in C but it needs to be run with all interrupts
 * suspended. It cannot be preempted. Suitable for short running services only.\n
 *   @remark
 * Tasks of the suspended process can continue running for a short while until their abort
 * conditions are checked the next time. The likelihood of such a continuation is little
 * and the duration is in the magnitude of a Millisecond.
 *   @remark
 * This function must never be called directly. The function is only made for placing it in
 * the global system call table.
 */
void rtos_scSmplHdlr_suspendProcess(uint32_t pidOfCallingTask, uint32_t PID)
{
    /* This code depends on specific number of processes, we need a check. The
       implementation requires consistent maintenance with other function
       rtos_grantPermissionSuspendProcess() */
#if RTOS_NO_PROCESSES != 4
# error Implementation requires the number of processes to be four
#endif

