PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_process.c
    /* Now we can check the index of the target process. */
    const unsigned int idxCalledPrc = PID - 1u;
    if(idxCalledPrc > 3)
        rtos_systemCallBadArgument();

    const uint16_t mask = 0x1 << (4u*(pidOfCallingTask-1u) + idxCalledPrc);
    if((_suspendProcess_permissions & mask) != 0)
        rtos_osSuspendProcess(PID);
    else
    {
        /* The calling process doesn't have enough privileges to suspend the aimed process.
           This is a severe user code error, which is handled with an exception, task abort
           and counted error.
             Note, this function does not return. */
        rtos_systemCallBadArgument();
    }
} /* End of rtos_scSmplHdlr_suspendProcess */




/**
 * Kernel function to initially release a process. "Initially" means that no state machine
 * is implemented, which would allow to alternatingly suspend and resume the operation of a
 * process. After startup, all processes are suspended. When the kernel is initialized it
 * may call this function once for each of the processes. It must however never se it again
 * for a process, e.g. after a call of rtos_osSuspendProcess().
 *   @param PID
 * The ID of the process to suspend in the range 1..4. Checked by assertion.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 */
void rtos_osReleaseProcess(uint32_t PID)
{
    /* The process array has no entry for the kernel process. An index offset by one
       results. */
    -- PID;

    assert(PID < sizeOfAry(rtos_processAry));
    rtos_processAry[PID].state = 1;

} /* End of rtos_osReleaseProcess */



/**
 * Kernel function to suspend a process. All currently running tasks belonging to the process
 * are aborted and the process is stopped forever (i.e. there won't be further task starts
 * or I/O driver callback invocations).
 *   @param PID
 * The ID of the process to suspend in the range 1..4. Checked by assertion.
 *   @remark
 * Tasks of the suspended process can continue running for a short while until their abort
 * conditions are checked the next time. The likelihood of such a continuation is little
 * and the duration is in the magnitude of a Millisecond.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 */
void rtos_osSuspendProcess(uint32_t PID)
{
    /* The process array has no entry for the kernel process. An index offset by one
       results. */
    -- PID;

    assert(PID < sizeOfAry(rtos_processAry));
    rtos_processAry[PID].state = 0;

} /* End of rtos_osSuspendProcess */



/**
 * Kernel function to read the suspend status of a process. This function is a simple
 * counterpart to rtos_osSuspendProcess(). It will return \a true after the other function
 * had been called for the given process ID or if the process is not at all in use.
 *   @param PID
 * The ID of the queried process in the range 1..4. Checked by assertion.
 *   @remark
 * This function can be called from OS and user context.
 */
bool rtos_isProcessSuspended(uint32_t PID)
{
    /* The process array has no entry for the kernel process. An index offset by one
       results. */
    -- PID;

    assert(PID < sizeOfAry(rtos_processAry));
    return rtos_processAry[PID].state == 0;

} /* End of rtos_isProcessSuspended */


/**
 * Get the number of task failures (and task abortions at the same time) counted for the
 * given process since start of the kernel.
 *   @return
 * Get total number of errors counted for process \a PID.
 *   @param PID
 * The ID of the queried process in the range 1 .. RTOS_NO_PROCESSES. An out of range PID
 * will always yield UINT_MAX and an assertion fires in DEBUG compilation. An unused
 * process has no errors.
 *   @remark
 * This function can be called from both, a user task or the OS context.
 */
unsigned int rtos_getNoTotalTaskFailure(unsigned int PID)
{
    if(--PID < RTOS_NO_PROCESSES)
        return rtos_processAry[PID].cntTotalTaskFailure;
    else
    {
        assert(false);
        return UINT_MAX;
    }
} /* End of rtos_getNoTotalTaskFailure */




/**
 * Get the number of task failures of given category counted for the given process since
 * start of the kernel.
 *   @return
 * Get total number of errors of category \a kindOfErr counted for process \a PID.
 *   @param PID
 * The ID of the queried process in the range 1 .. RTOS_NO_PROCESSES. An out of range PID
 * will always yield UINT_MAX and an assertion fires in DEBUG compilation. An unused
 * process has no errors.
 *   @param kindOfErr
 * The category of the error. See file rtos_ivorHandler.h,
 * #RTOS_ERR_PRC_MACHINE_CHECK and following, for the enumerated error causes.
 *   @remark
 * This function can be called from both, a user task or the OS context.
 */
unsigned int rtos_getNoTaskFailure(unsigned int PID, unsigned int kindOfErr)
{
    if(--PID < RTOS_NO_PROCESSES
       &&  kindOfErr < sizeOfAry(rtos_processAry[PID].cntTaskFailureAry)
      )
    {
        return rtos_processAry[PID].cntTaskFailureAry[kindOfErr];
    }
    else
    {
        assert(false);
        return UINT_MAX;
    }
} /* End of rtos_getNoTaskFailure */

